cmmteam3_flutterbackend/flutter_backend/app/controllers/application_controller.rb

SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`id` = 1 LIMIT 1
SELECT `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`id` = 1 LIMIT 1
---
  def authenticate_request
    header = request.headers["Authorization"]
    if header.present?
      header = header.split.last # Remove unnecessary split("").last
      begin
        decoded = jwt_decode(header)
        @current_user = MUser.find(decoded[:user_id])
        @current_workspace = MWorkspace.find(decoded[:workspace_id])